Avraham565/smart-kosher/experiments/zigbee_probe/h2_coordinator_firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32h2"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

CONFIG_COORD_UART_PORT=1
CONFIG_COORD_UART_TXD_PIN=24
CONFIG_COORD_UART_RXD_PIN=2
CONFIG_COORD_UART_BAUD_RATE=115200

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCZR=y
CONFIG_ZB_GP_ENABLED=n
